-- MySQL dump 10.13  Distrib 8.0.33, for Win64 (x86_64)
--
-- Host: localhost    Database: moviedb
-- ------------------------------------------------------
-- Server version	8.0.33

/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!50503 SET NAMES utf8 */;
/*!40103 SET @OLD_TIME_ZONE=@@TIME_ZONE */;
/*!40103 SET TIME_ZONE='+00:00' */;
/*!40014 SET @OLD_UNIQUE_CHECKS=@@UNIQUE_CHECKS, UNIQUE_CHECKS=0 */;
/*!40014 SET @OLD_FOREIGN_KEY_CHECKS=@@FOREIGN_KEY_CHECKS, FOREIGN_KEY_CHECKS=0 */;
/*!40101 SET @OLD_SQL_MODE=@@SQL_MODE, SQL_MODE='NO_AUTO_VALUE_ON_ZERO' */;
/*!40111 SET @OLD_SQL_NOTES=@@SQL_NOTES, SQL_NOTES=0 */;

--
-- Table structure for table `nation`
--

DROP TABLE IF EXISTS `nation`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `nation` (
  `m_nation` varchar(45) NOT NULL,
  `FK_m_number` int NOT NULL,
  KEY `fk_nation_movie1_idx` (`FK_m_number`),
  CONSTRAINT `fk_nation_movie1` FOREIGN KEY (`FK_m_number`) REFERENCES `movie` (`m_number`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb3;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `nation`
--

LOCK TABLES `nation` WRITE;
/*!40000 ALTER TABLE `nation` DISABLE KEYS */;
INSERT INTO `nation` VALUES ('한국',407),('독일',241),('한국',246),('한국',331),('오스트리아',329),('오스트리아',438),('미국',108),('미국',154),('루마니아',479),('독일',399),('독일',360),('일본',218),('스페인',328),('미국',5),('한국',28),('한국',58),('한국',3),('영국',109),('미국',213),('일본',113),('미국',427),('한국',304),('한국',403),('미국',86),('독일',27),('일본',390),('한국',172),('한국',291),('독일',346),('미국',478),('미국',208),('한국',98),('한국',19),('한국',120),('중국',11),('인도',448),('한국',362),('프랑스',296),('미국',76),('미국',391),('일본',105),('일본',124),('미국',256),('미국',473),('한국',293),('한국',32),('한국',234),('미국',232),('한국',240),('한국',140),('미국',392),('미국',107),('프랑스',250),('프랑스',415),('한국',354),('한국',33),('미국',277),('한국',348),('미국',8),('한국',31),('한국',48),('미국',260),('미국',372),('한국',274),('한국',38),('한국',440),('일본',405),('오스트레일리아',281),('미국',112),('일본',371),('한국',88),('벨기에',198),('미국',176),('캐나다',191),('한국',149),('프랑스',146),('한국',13),('미국',287),('한국',216),('영국',117),('일본',165),('한국',157),('한국',119),('영국',51),('미국',97),('미국',460),('스페인',9),('미국',446),('미국',16),('한국',271),('터키',50),('미국',30),('미국',356),('한국',225),('미국',383),('영국',35),('한국',141),('한국',169),('중국',10),('일본',94),('미국',59),('영국',63),('독일',174),('한국',290),('한국',222),('한국',20),('한국',459),('한국',114),('한국',49),('한국',376),('영국',17),('일본',288),('홍콩',15),('영국',137),('한국',318),('한국',132),('미국',82),('멕시코',41),('캐나다',341),('미국',180),('미국',61),('한국',312),('한국',110),('한국',44),('일본',238),('한국',80),('홍콩',40),('프랑스',289),('캐나다',178),('덴마크',254),('프랑스',353),('한국',480),('한국',380),('러시아',378),('핀란드',54),('한국',450),('미국',294),('일본',303),('태국',314),('독일',280),('영국',258),('미국',394),('프랑스',130),('프랑스',355),('미국',476),('한국',160),('홍콩',158),('프랑스',106),('네덜란드',203),('미국',373),('홍콩',190),('한국',370),('캐나다',46),('일본',308),('아르헨티나',92),('한국',96),('미국',311),('한국',164),('일본',441),('미국',457),('오스트레일리아',231),('한국',166),('한국',23),('미국',22),('미국',53),('미국',285),('한국',77),('일본',452),('미국',361),('한국',417),('영국',228),('한국',18),('프랑스',468),('대만',259),('대만',148),('캐나다',283),('프랑스',47),('한국',201),('중국',352),('홍콩',209),('한국',100),('중국',2),('미국',333),('독일',351),('한국',432),('미국',458),('한국',89),('독일',125),('한국',469),('독일',193),('일본',6),('한국',422),('미국',60),('한국',79),('미국',276),('덴마크',339),('한국',368),('미국',401),('한국',295),('한국',298),('태국',410),('한국',268),('미국',199),('중국',270),('미국',72),('덴마크',188),('미국',412),('미국',375),('한국',136),('한국',461),('영국',168),('한국',379),('미국',395),('핀란드',211),('한국',365),('미국',34),('인도',350),('미국',251),('미국',189),('나이지리아',205),('프랑스',67),('러시아',374),('한국',286),('미국',116),('한국',443),('한국',278),('한국',185),('영국',321),('프랑스',453),('한국',282),('한국',134),('한국',445),('미국',68),('프랑스',330),('스웨덴',196),('미국',247),('스페인',474),('일본',411),('미국',327),('중국',184),('미국',219),('대만',192),('대만',36),('한국',187),('한국',343),('영국',337),('한국',332),('한국',326),('프랑스',431),('브라질',220),('영국',123),('한국',428),('미국',347),('한국',102),('독일',175),('한국',467),('한국',162),('일본',248),('한국',147),('미국',21),('스위스',421),('미국',300),('홍콩',425),('미국',305),('미국',447),('미국',135),('미국',409),('프랑스',252),('미국',454),('한국',207),('한국',237),('한국',434),('미국',57),('일본',42),('일본',163),('홍콩',272),('일본',142),('우크라이나',74),('미국',215),('미국',340),('한국',43),('한국',111),('미국',179),('한국',397),('프랑스',159),('대만',70),('한국',338),('한국',121),('일본',414),('캐나다',229),('미국',388),('한국',81),('미국',463),('한국',292),('한국',386),('한국',302),('한국',183),('미국',133),('한국',413),('한국',334),('한국',297),('프랑스',439),('중국',101),('한국',52),('덴마크',122),('라트비아',357),('영국',363),('유고슬라비아',90),('미국',400),('미국',464),('미국',261),('한국',64),('한국',12),('중국',266),('한국',265),('일본',233),('미국',279),('한국',451),('프랑스',85),('미국',320),('일본',118),('홍콩',366),('미국',99),('프랑스',307),('스페인',393),('일본',275),('한국',477),('미국',398),('미국',155),('한국',267),('한국',84),('스페인',95),('미국',349),('스위스',387),('한국',152),('한국',194),('한국',436),('일본',4),('한국',230),('영국',129),('태국',24),('한국',424),('미국',217),('미국',161),('한국',200),('미국',69),('미국',151),('미국',186),('한국',244),('한국',227),('미국',310),('한국',264),('한국',7),('일본',62),('이탈리아',204),('미국',223),('미국',131),('한국',236),('한국',245),('한국',455),('이탈리아',466),('한국',475),('한국',212),('미국',325),('한국',197),('미국',437),('미국',406),('한국',210),('한국',322),('한국',471),('한국',214),('한국',359),('미국',284),('한국',171),('네덜란드',138),('한국',384),('체코',144),('홍콩',255),('한국',39),('미국',14),('미국',262),('한국',317),('영국',103),('홍콩',75),('미국',78),('한국',313),('한국',358),('일본',55),('미국',377),('한국',385),('일본',206),('일본',167),('한국',37),('한국',404),('스웨덴',243),('한국',1),('일본',150),('한국',173),('한국',470),('한국',104),('한국',263),('미국',420),('미국',26),('한국',433),('영국',426),('영국',430),('한국',299),('일본',396),('영국',153),('캐나다',25),('홍콩',319),('일본',253),('일본',301),('일본',182),('프랑스',115),('미국',449),('아일랜드',389),('한국',71),('네덜란드',226),('일본',316),('미국',87),('영국',224),('한국',345),('미국',65),('미국',408),('한국',456),('미국',239),('미국',269),('홍콩',381),('오스트레일리아',324),('영국',342),('미국',126),('한국',73),('한국',482),('일본',177),('미국',128),('미국',364),('프랑스',309),('미국',423),('미국',382),('미국',45),('한국',481),('중국',335),('한국',145),('미국',139),('미국',472),('미국',170),('미국',56),('미국',315),('미국',195),('한국',336),('인도네시아',418),('일본',156),('일본',273),('일본',462),('프랑스',344),('일본',435),('일본',202),('영국',442),('영국',419),('노르웨이',429),('한국',235),('독일',91),('미국',93),('미국',323),('미국',66),('한국',367),('한국',83),('영국',306),('미국',127),('한국',402),('멕시코',257),('한국',242),('한국',143),('홍콩',465),('홍콩',181),('일본',29),('프랑스',416),('덴마크',221);
/*!40000 ALTER TABLE `nation` ENABLE KEYS */;
UNLOCK TABLES;
/*!40103 SET TIME_ZONE=@OLD_TIME_ZONE */;

/*!40101 SET SQL_MODE=@OLD_SQL_MODE */;
/*!40014 SET FOREIGN_KEY_CHECKS=@OLD_FOREIGN_KEY_CHECKS */;
/*!40014 SET UNIQUE_CHECKS=@OLD_UNIQUE_CHECKS */;
/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
/*!40111 SET SQL_NOTES=@OLD_SQL_NOTES */;

-- Dump completed on 2023-08-17 17:21:58
